/*1. Напишіть програму, яка залежно від введеної користувачем літери виводить на
екран відповідну інформацію про день тижня, на який припадає ця літера
(наприклад, якщо введено "M", то на екрані повинно вивестися "Monday - Понеділок").*/
let ch=prompt("Введіть літеру");
if(ch==="M"|| ch==="П")alert("Monday - Понеділок")
else if(ch==="T" || ch==="В")alert("Tuesday - Вівторок")
else if(ch==="W" || ch==="С")alert("Wednesday - Середа")
else if(ch==="Th" || ch==="Ч")alert("Thursday - Четвер")
else if(ch==="F" || ch==="Пт")alert("Friday - П'ятниця")
else if(ch==="S" || ch==="Сб")alert("Saturday - Субота")
else if(ch==="Sn" || ch==="Н")alert("Sunday - Неділя")
else alert("Помилка вводу")
/*2.Напишіть програму, яка переводить введене користувачем число в римський
запис. Наприклад, якщо введено число 4, то на екрані повинен вивестися рядок
"IV".
*/
let num = Number(prompt("Введи число"))
let RomNum = ""
if (num >= 3000) {
        RomNum += "MMM"
        num -= 3000
    }
if (num >= 2000) {
        RomNum += "MM"
        num -= 2000
    }
if (num >= 1000) {
        RomNum += "M"
        num -= 1000
    }
if (num >= 900) {
        RomNum += "CM"
        num -= 900
    }
if (num >= 500) {
        RomNum += "D"
        num -= 500
    }
if (num >= 400) {
        RomNum += "CD"
        num -= 400
    }
if (num >= 300) {
        RomNum += "CCC"
        num -= 300
    }
if (num >= 200) {
        RomNum += "CC"
        num -= 200
    }
if (num >= 100) {
        RomNum += "C"
        num -= 100
    }
if (num >= 90) {
        RomNum += "XC"
        num -= 90
    }
if (num >= 50) {
        RomNum += "L"
        num -= 50
    }
if (num >= 40) {
        RomNum += "XL"
        num -= 40
    }
if (num >= 30) {
        RomNum += "XXX"
        num -= 30
    }
if (num >= 20) {
        RomNum += "XX"
        num -= 20
    }
if (num >= 10) {
        RomNum += "X"
        num -= 10
    }
if (num >= 9) {
        RomNum += "IX"
        num -= 9
    }
if (num >= 5) {
        RomNum += "V"
        num -= 5
    }
if (num >= 4) {
        RomNum += "IV"
        num -= 1
    }
if (num >= 3) {
        RomNum += "III"
        num -= 1
    }
if (num >= 2) {
        RomNum += "II"
        num -= 1
    }
if (num >= 1) {
        RomNum += "I"
        num -= 1
    }
alert(RomNum)
/*3. Напишіть програму, яка залежно від введеного користувачем коду кольору
виводить на екран назву цього кольору (наприклад, якщо введено код #FF0000,
то на екрані повинно вивестися "Red - Червоний").*/
let col=prompt("введи код кольору")
if(col==="#FF0000")alert("Red - Червоний")
else if(col==="#00FF00")alert("Green - Зелений")
else if(col==="#0000FF")alert("Blue - Синій")
else if(col==="#FFFFFF")alert("White - Білий")
else if(col==="#FFFF00")alert("Yellow - Жовтий")
else if(col==="#FF00FF")alert("Pink - Рожевий")
else if(col==="#00FFFF")alert("light blue - Блакитний")
else if(col==="#000000")alert("Black - Чорний")
else alert("невідомий колір")
/*4. Напишіть програму, яка залежно від введеного користувачем числа виводить на
екран назву відповідної геометричної фігури (наприклад, якщо введено число 3,
то на екрані повинно вивестися "Triangle - Трикутник").*/
let fig=prompt("введи кількість вершин")
fig=Number(fig)
if(Number.isNaN(fig)){
    alert("помилка вводу")
}
else if(fig===1) alert("крапка")
else if(fig===2) alert("відрізок")
else if(fig===3) alert("трикутник")
else if(fig===4) alert("квадрат")
else if(fig===5) alert("п'ятикутник")
else if(fig===6) alert("шестикутник")
else if(fig===7) alert("семикутник")
else alert("невідома фігура")
/*5. Напишіть програму, яка залежно від введеного користувачем місяця виводить
на екран кількість днів у цьому місяці.*/
let month=prompt("введи місяць року")
if(month==="Січень"
    ||month==="Березень"
    ||month==="Травень"
    ||month==="Липень"
    ||month==="Серпень"
    ||month==="Жовтень"
    ||month==="Грудень"
)alert("31 день")
else if(month==="Квітень"
    ||month==="Червень"
    ||month==="Вересень"
    ||month==="Листопад"
)alert("30 днів")
else if(month==="Лютий") alert("28/29 днів")
/*6. Напишіть програму, яка залежно від введеного користувачем знаку зодіаку
виводить на екран відповідну характеристику людини, яка народилася під цим
знаком.*/
let s=prompt("введіть знак зодіаку")
if(s==="Овен"){
    alert("Усі Овни люблять бути номер один, тому не дивно, що цей знак зодіаку — перший у списку. Будучи типовими представниками стихії вогню, Овни вирізняються високою енергійністю, імпульсивністю та неабиякою амбіційністю. Символом цього знака зодіаку є баран із загнутими рогами, що демонструє агресію, силу та авторитарність. Якщо говорити про негативні сторони, то це власне і є надмірне бажання все контролювати та часом заграватися у диктаторів");
}
else if(s==="Телець"){
    alert("Тельці є типовими представниками стихії землі, тому вони вирізняються теплотою і пристрасністю. Характерними рисами для представників цих знаків зодіаку є практичність, консервативність, прагнення до фінансової стабільності та комфорту. Тельці ніколи не підуть на грандіозні ризики заради примарної мрії чи непевної ідеї, тому авантюрні подорожі та професії — не їхня історія. Світ Тельців дуже лаконічний, логічний, впорядкований та комфортний. Стабільність — їхнє все.");
}
else if(s==="Близнюки"){
    alert("Характеристика знаку зодіаку Близнюки співзвучна з його назвою. Роздвоєння особистості, перепади настрою й пошуки себе найбільш характерні саме для Близнюків. Власне тому вони рідко відчувають абсолютне щастя та гармонію із собою. Говорячи про переваги цього знака зодіаку, варто згадати про те, що стихія повітря наділяє їх спритністю, жвавістю й комунікабельністю та прагненням до нових висот. Як правило, лише рух дарує їм почуття щастя.");
}
else if(s==="Рак"){
    alert("Людей, які народились під знаком зодіаку Рак, у суспільстві часто сприймають як складних, загадкових і нелогічних натур. Здебільшого так і є. Вони дуже таємничі й закриті для зовнішнього світу і важко йдуть на контакт із новими людьми. Однак за товстою оболонкою приховується чутлива та вразлива натура. До речі, найбільше хвилюються за амурні справи та піддаються впливу негативних зовнішніх факторів саме Раки.");
}
else if(s==="Лев"){
    alert("Леви — це справжні королі та королеви джунглів. Представники цього вогняного знаку з задоволенням приймають свій королівський статус: жваві та запальні, вони люблять побути в центрі уваги. Не дарма, адже планета покровитель Левів — Сонце. Правлять цими людьми здебільшого амбіційність, самолюбство та гордість. До речі, з останньою вони можуть часто перегинати палицю, так само, як і з жагою лестощів у свій бік.");
}
else if(s==="Діва"){
    alert("Символ Діви історично представляв богинь пшениці та землеробства. Цей образ говорить сам за себе у матеріальному світі. Діви логічні, практичні та систематичні у своєму підході до життя. Представники цього знаку зодіаку зазвичай у душі перфекціоністи й не бояться вдосконалювати свої навички завдяки старанній і послідовній праці. Діви, як правило, не люблять публічність, вони рідко стають центром загальної уваги.");
}
else if(s==="Терези"){
    alert("Терези — це повітряний знак, що знаходиться під покровом Венери й Сатурна одразу. Їх символом є ваги — єдиний неживий об’єкт зодіаку, який символізує концентрацію на рівновазі та гармонії. Терези одержимі симетрією і прагнуть досягти балансу у всіх сферах життя. Розсудливість, схильність до сумнівів — це теж про Терезів, яким важко даються вибори, особливо життєво важливі.");
}
else if(s==="Скорпіон"){
    alert("Скорпіонів цілком заслужено можна назвати представниками одного з найскладніших за характером знаків зодіаку. Вони вкрай чутливі та вразливі, однак не схильні проявляти ці риси на публіці, воліючи проживати все в собі, або розділяти з дуже близькими людьми. Заради власних амбіцій та цілей Скорпіони можуть навіть забувати про власні принципи та переконання.");
}
else if(s==="Стрілець"){
    alert("Народжені під знаком Стрільця люди, завжди перебувають у пошуку нових знань та емоцій. Вони заповзятливі, люблять пригоди й подорожі, легкі на підйом і схильні до ризику. Навіть опинившись у незвичних, нових для себе обставинах, представники цього знака не розгубляться й легко знайдуть однодумців і друзів. Товариськість і відкритість допомагає їм легко крокувати життєвим шляхом і долати всі труднощі.");
}
else if(s==="Козеріг"){
    alert("Про Козерогів часто відгукуються як про надзвичайно стриманих, організованих та практичних осіб. Ці риси часто допомагають досягти неабиякого успіху та тримати всі життєві ситуації під контролем. Представники цього знака зазвичай не виносять особисті проблеми й почуття на публіку, а у формуванні власної репутації воліють робити ставку не на екстравагантність або підкреслення власної індивідуальності, а на коректну поведінку й елегантний формалізм.");
}
else if(s==="Водолій"){
    alert("Представники знака зодіаку Водолій часто демонструють свій статус «в активному пошуку». Мова йде про нову інформацію, відчуття, подорожі та незвичний досвід. Водолії завжди прагнуть до оригінальності, яка проявляється буквально у всьому — від способу мислення до способу життя. Вони не виставляють напоказ свої досягнення, проте дуже люблять, коли їх індивідуальність оцінюють.");
}
else if(s==="Риби"){
    alert("Риби — останній, 12-й знак Зодіаку, що завершує астрологічне зодіакальне коло. Риби є одним із найбільш суперечливих представників зодіакального сузір’я. Стихія води визначає мінливість і нестабільність їх натури. Сузір’я Риб управляється відразу Юпітером і Нептуном, а тому мінливість характеру забезпечена їм із самого народження. Найчастіше Риби реалізовують себе у творчих професіях, які вимагають частої зміни іміджу й ходу думок.");
}
else{
    alert("невідомий знак зодіаку");
}
/*7. Напишіть програму, яка залежно від введеного користувачем рівня освіти
виводить на екран максимальну зарплату, яку можна отримати за рік
(наприклад, якщо рівень освіти "бакалавр", то на екрані повинно вивестися "40
000 доларів").*/
let ed=prompt("введіть рівень освіти")
if(ed==="Бакалавр"){
    alert("40000 доларів")
}
else if(ed==="Магістр"){
    alert("60000 доларів")
}
else if(ed==="ПТУ"){
    alert("10000 доларів")
}
else{
    alert("невідомий рівень освіти")
}
/*8. Напишіть програму, яка залежно від введеного користувачем номера місяця
виводить на екран пору року, до якої цей місяць належить (наприклад, якщо
введено номер 8, то на екрані повинно вивестися "Summer - Літо").
*/
let mon=prompt("Введіть номер місяця");
mon=Number(mon)
if(Number.isNaN(mon)){
    alert("це не номер")
}
else if(mon<1||mon>12||!Number.isInteger(mon)){
    alert("це не номер місяця")
}
else if(mon>=3 && mon<=5){
    alert("Spring - Весна")
}
else if(mon>=3 && mon<=5){
    alert("Summer - Літо")
}
else if(mon>=3 && mon<=5){
    alert("Autumn - Осінь")
}
else alert("Winter - Зима")
/*9. Напишіть програму, яка залежно від введеного користувачем дня тижня
виводить на екран чи це робочий день, чи вихідний*/
let weekDay=prompt("Введи день тижня")
if(weekDay==="Понеділок"
    ||weekDay==="Вівторок"
    ||weekDay==="Середа"
    ||weekDay==="Четвер"
    ||weekDay==="П'ятниця"
){
    alert("Робочий день")
}
else if(weekDay==="Субота"
    ||weekDay==="Неділя"){
    alert("Вихідний");
}
else{
    alert("невідомий день тижня")
}
/*10. Напишіть програму, яка залежно від введеного користувачем числа виводить на
екран, чи це парне, чи непарне число*/
let num10=Number(prompt("Введіть число"))
if(Number.isNaN(num10)){
    alert("це не число")
}
else if(num10%2===0){
    alert("число парне")
}
else alert("число непарне")